[
	{
		"title": "My Projects",
		"prodLink": "",
		"githubLink": "",
		"description": ""
	},
	{
		"title": "My Music Page",
		"prodLink": "https://obrientrombone.com",
		"githubLink": "https://github.com/csobrien90/obrien-trombone",
		"description": "My landing page as a professional musician. It is a mobile-first, responsive site that uses semantic HTML5, CSS3, JavaScript, and PHP. Since I initially built this site as the final project of my Code Louisville Front End Web Development course, it's packed with fun JS scripts. Check out the README in my GitHub repo for a full list of design features."
	},
	{
		"title": "Louisville Jazz Initiative",
		"prodLink": "https://louisvillejazzinitiative.com",
		"githubLink": "",
		"description": "This is the website for the Louisville Jazz Initiative, a non profit organization I co-founded in April 2021. I built this website before knowing about mobile-first design, accessibilty standards, and CSS flexbox and am now in the process of updating it to reflect best practices."
	},
	{
		"title": "Code Breaker",
		"prodLink": "https://csobrien90.github.io/mastermind",
		"githubLink": "https://github.com/csobrien90/mastermind",
		"description": "This is my take on the classic paper and pencil game: Mastermind. The notebook paper styling has been fun to experiment with but needs a little more tweaking to be made more responsive. Check it out and play to your hearts content (it's pretty addicting!)"
	},
	{
		"title": "Fiber Coven",
		"prodLink": "https://fibercoven.com",
		"githubLink": "https://github.com/csobrien90/fiber-coven",
		"description": "Fiber Coven is a weekly witchy themed podcast about knitting, spinning, and everything fiber related. Making this website was a great opportunity to work with an established brand and integrate third party widgets like a PodBean player and MailChimp newsletter sign up into the design."
	},
	{
		"title": "More projects coming soon...",
		"prodLink": "",
		"githubLink": "",
		"description": ""
	}
]