[
	{
		"title": "Band Book",
		"prodLink": "https://bandbook.s3.us-east-2.amazonaws.com/index.html",
		"githubLink": "https://github.com/csobrien90/band-book",
		"description": "The BandBook application is a tool for ear musicians. It is designed to help users learn songs by ear, transcribe, practice, study, and share and collaborate with others. On the technical side, this application has an (arguably) overzealous commitment to modern web standards. The stack is comprised of exclusively modern vanilla HTML5, CSS3, and JavaScript (ES6+). All JavaScript is written in an Object-Oriented Programming (OOP) style and type safety is enforced through JSDoc comments. The application is local first and uses IndexedDB for data storage."
	},
	{
		"title": "Shows in Town",
		"prodLink": "https://chado.dev/shows-in-town",
		"githubLink": "https://github.com/csobrien90/shows-in-town",
		"description": "Shows in Town is a web application that leverages Puppeteer and open APIs with a Node backend to scrape local venues, event calendars, band websites, etc. for upcoming live music shows and displays them in a single, easy to navigate timeline built with React."
	},
	{
		"title": "Portfolio (this page 🎉)",
		"prodLink": "#about",
		"githubLink": "https://github.com/csobrien90/portfolio",
		"description": "This site is built in React and uses all original components. Some of the cooler features (IMHO) include the dual-purpose navigation and section header, project slider, totally responsive layout, and original themed color block design, and serverless contact form functionality using AWS Lambda."
	},
	{
		"title": "Lighthouse Audit Automation",
		"githubLink": "https://github.com/csobrien90/lighthouse-audit-automation",
		"description": "This is a node package to automate Google Lighthouse audits on multiple sites simultaneously. Given a root URL and array of directories/subdirectories/pages, this outputs a .csv containing two tables (mobile and desktop) with metrics for performance, accessibility, adherence to best practices, and SEO."
	}
]